## Module 1 homework - a bit of EDA and testing the ingestion

In [1]:
import pandas as pd

In [2]:
!pwd

/workspaces/datatalksclub-data-engineering-zoomcamp-2026/Module_1

### Reading the trip data parquet file

In [3]:
data_prefix = "/workspaces/datatalksclub-data-engineering-zoomcamp-2026/data_files/"
df_trip = pd.read_parquet(data_prefix + "green_tripdata_2025-11.parquet")

# Display first rows
df_trip.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,...,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge,cbd_congestion_fee
0,2,2025-11-01 00:34:48,2025-11-01 00:41:39,N,1.0,74,42,1.0,0.74,7.2,...,0.5,1.94,0.0,NaN,1.0,11.64,1.0,1.0,0.00,0.0
1,2,2025-11-01 00:18:52,2025-11-01 00:24:27,N,1.0,74,42,2.0,0.95,7.2,...,0.5,0.00,0.0,NaN,1.0,9.70,2.0,1.0,0.00,0.0
2,2,2025-11-01 01:03:14,2025-11-01 01:15:24,N,1.0,83,160,1.0,2.19,13.5,...,0.5,5.00,0.0,NaN,1.0,21.00,1.0,1.0,0.00,0.0
3,2,2025-11-01 00:10:57,2025-11-01 00:24:53,N,1.0,166,127,1.0,5.44,24.7,...,0.5,0.50,0.0,NaN,1.0,27.70,1.0,1.0,0.00,0.0
4,1,2025-11-01 00:03:48,2025-11-01 00:19:38,N,1.0,166,262,1.0,3.20,18.4,...,1.5,1.00,0.0,NaN,1.0,24.65,1.0,1.0,2.75,0.0

In [4]:
# Check data types
print(df_trip.dtypes)

# Check data shape
print(df_trip.shape)

VendorID                          int32
lpep_pickup_datetime     datetime64[us]
lpep_dropoff_datetime    datetime64[us]
store_and_fwd_flag               object
RatecodeID                      float64
PULocationID                      int32
DOLocationID                      int32
passenger_count                 float64
trip_distance                   float64
fare_amount                     float64
extra                           float64
mta_tax                         float64
tip_amount                      float64
tolls_amount                    float64
ehail_fee                       float64
improvement_surcharge           float64
total_amount                    float64
payment_type                    float64
trip_type                       float64
congestion_surcharge            float64
cbd_congestion_fee              float64
dtype: object
(46912, 21)

In [5]:
df_trip.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46912 entries, 0 to 46911
Data columns (total 21 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   VendorID               46912 non-null  int32
 1   lpep_pickup_datetime   46912 non-null  datetime64[us]
 2   lpep_dropoff_datetime  46912 non-null  datetime64[us]
 3   store_and_fwd_flag     41343 non-null  object
 4   RatecodeID             41343 non-null  float64
 5   PULocationID           46912 non-null  int32
 6   DOLocationID           46912 non-null  int32
 7   passenger_count        41343 non-null  float64
 8   trip_distance          46912 non-null  float64
 9   fare_amount            46912 non-null  float64
 10  extra                  46912 non-null  float64
 11  mta_tax                46912 non-null  float64
 12  tip_amount             46912 non-null  float64
 13  tolls_amount           46912 non-null  float64
 14  ehail_fee              0 non-null      float64
 15  improvement_surcharge  46912 non-null  float64
 16  total_amount           46912 non-null  float64
 17  payment_type           41343 non-null  float64
 18  trip_type              41342 non-null  float64
 19  congestion_surcharge   41343 non-null  float64
 20  cbd_congestion_fee     46912 non-null  float64
dtypes: datetime64[us](2), float64(15), int32(3), object(1)
memory usage: 7.0+ MB

### Reading the zone data csv file

In [6]:
df_zone = pd.read_csv(data_prefix + "taxi_zone_lookup.csv")

# Display first rows
df_zone.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [7]:
# Check data types
print(df_zone.dtypes)
# Check data shape
print(df_zone.shape)

LocationID       int64
Borough         object
Zone            object
service_zone    object
dtype: object
(265, 4)

### Ingesting the data into Postgres
#### DB connection

In [8]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

#### Lowercasing the column names

There's some complexities involving column names with uppercase letters with Postgres. Right now I won't bother myself with those and just lowercase the df column names.

In [9]:
df_trip.columns = df_trip.columns.str.lower()
df_zone.columns = df_zone.columns.str.lower()

#### Trip data DDL

In [10]:

print(pd.io.sql.get_schema(df_trip, name='green_taxi_nov_2025', con=engine))

CREATE TABLE green_taxi_nov_2025 (
	vendorid INTEGER,
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	ratecodeid FLOAT(53),
	pulocationid INTEGER,
	dolocationid INTEGER,
	passenger_count FLOAT(53),
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type FLOAT(53),
	trip_type FLOAT(53),
	congestion_surcharge FLOAT(53),
	cbd_congestion_fee FLOAT(53)
)

#### Taxi zone DDL

In [11]:
print(pd.io.sql.get_schema(df_zone, name='taxi_zones', con=engine))

CREATE TABLE taxi_zones (
	locationid BIGINT,
	borough TEXT,
	zone TEXT,
	service_zone TEXT
)

#### Create taxi zones table
Here there are so few rows that chunking is unnecessary.

In [12]:
df_zone.to_sql(name="taxi_zones", con=engine, index=False, if_exists='replace')

265

#### Checking the results

In [13]:
from sqlalchemy import text
query = "SELECT * FROM taxi_zones;"
df_pg_zones = pd.read_sql(text(query), con=engine)

In [14]:
print(df_pg_zones.shape)
print(df_pg_zones.head())

(265, 4)
   locationid        borough                     zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

#### Creating the taxi trip table

In [52]:

df_trip.to_sql(
    name='green_taxi_nov_2025', 
    con=engine, 
    if_exists='replace', # or 'replace'
    index=False, 
    chunksize=10000,    # Number of rows per batch
    method='multi'      # Essential for performance
)

46912

#### Checking again

In [53]:
query = "SELECT * FROM green_taxi_nov_2025;"
df_pg_trips = pd.read_sql(text(query), con=engine)

In [54]:
print(df_pg_trips.shape)
print(df_pg_trips.iloc[:5,:4])

(46912, 21)
   vendorid lpep_pickup_datetime lpep_dropoff_datetime store_and_fwd_flag
0         2  2025-11-01 00:34:48   2025-11-01 00:41:39                  N
1         2  2025-11-01 00:18:52   2025-11-01 00:24:27                  N
2         2  2025-11-01 01:03:14   2025-11-01 01:15:24                  N
3         2  2025-11-01 00:10:57   2025-11-01 00:24:53                  N
4         1  2025-11-01 00:03:48   2025-11-01 00:19:38                  N

#### Question 3. Counting short trips
For the trips in November 2025 (lpep_pickup_datetime between '2025-11-01' and '2025-12-01', exclusive of the upper bound), how many trips had a trip_distance of less than or equal to 1 mile?

- 7,853
- 8,007
- 8,254
- 8,421

In [55]:
query = text("""
    SELECT count(*) 
    FROM green_taxi_nov_2025 
    WHERE lpep_pickup_datetime >= :start_date 
      AND lpep_pickup_datetime < :end_date
      AND trip_distance <= :distance
""")

with engine.connect() as conn:
    result = conn.execute(query, {"start_date": "2025-11-01", "end_date": "2025-12-01", "distance": 1.0})
    count = result.scalar()
    print(count)

8007

#### Question 4. Longest trip for each day
Which was the pick up day with the longest trip distance? Only consider trips with trip_distance less than 100 miles (to exclude data errors).

Use the pick up time for your calculations.

- 2025-11-14
- 2025-11-20
- 2025-11-23
- 2025-11-25

In [56]:
query = text("""
    SELECT lpep_pickup_datetime 
    FROM green_taxi_nov_2025 
    WHERE trip_distance < :distance
    ORDER BY trip_distance DESC
    LIMIT 1
""")

with engine.connect() as conn:
    result = conn.execute(query, {"distance": 100.0})
    pickup_date = result.scalar()
    print(pickup_date)

2025-11-14 15:36:27

#### Question 5. Biggest pickup zone
Which was the pickup zone with the largest total_amount (sum of all trips) on November 18th, 2025?

- East Harlem North
- East Harlem South
- Morningside Heights
- Forest Hills

In [57]:
query = text("""
    SELECT t.zone, sum(g.fare_amount) as total_amount
    FROM green_taxi_nov_2025 g 
    INNER JOIN taxi_zones t ON g.pulocationid = t.locationid    
    WHERE 
        g.lpep_pickup_datetime >= :start_date
    AND g.lpep_pickup_datetime < :next_date
    GROUP BY t.zone
    ORDER BY total_amount DESC
""")
df_temp = pd.read_sql(query, engine, params={"start_date": "2025-11-18", "next_date": "2025-11-19"})
df_temp.head()

                       zone  total_amount
0         East Harlem North       6555.32
1         East Harlem South       4350.43
2  Washington Heights South       1626.22
3              Central Park       1574.10
4                   Jamaica       1549.46

#### Question 6. Largest tip
For the passengers picked up in the zone named "East Harlem North" in November 2025, which was the drop off zone that had the largest tip?

Note: it's tip , not trip. We need the name of the zone, not the ID.

- JFK Airport
- Yorkville West
- East Harlem North
- LaGuardia Airport

In [58]:
query = text("""
    WITH east_harlem_pickups AS (
        SELECT t.zone, g.pulocationid, g.dolocationid, g.tip_amount, g.lpep_pickup_datetime
    FROM green_taxi_nov_2025 g 
    INNER JOIN taxi_zones t ON g.pulocationid = t.locationid    
    WHERE 
        t.zone = 'East Harlem North'
    )
    SELECT t.zone, e.tip_amount, e.lpep_pickup_datetime
    FROM east_harlem_pickups e 
    INNER JOIN taxi_zones t ON e.dolocationid = t.locationid    
    ORDER BY e.tip_amount DESC
    LIMIT 20         
""")
df_temp = pd.read_sql(query, engine)
df_temp.head()

                            zone  tip_amount lpep_pickup_datetime
0                 Yorkville West       81.89  2025-11-30 16:30:27
1              LaGuardia Airport       50.00  2025-11-23 13:35:27
2              East Harlem North       45.00  2025-11-29 01:44:21
3  Long Island City/Queens Plaza       34.25  2025-11-24 08:36:03
4                           None       28.90  2025-11-15 12:49:08